-- LABORATORY WORK 2
-- BY Chala_Hanna
/*---------------------------------------------------------------------------
1. Вивести ключ покупця та ключ продукту за умови, що покупець купив більше 5 одиниць цього продукту.

---------------------------------------------------------------------------*/
--Код відповідь:








  
/* --------------------------------------------------------------------------- 
2.  Вивести ключ постачальника на номери замовлень, що містять більше одного з його товарів.

---------------------------------------------------------------------------*/
--Код відповідь:
SELECT COUNT(PROD_ID) AS PROD,
ORDER_NUM
FROM ORDERITEMS
GROUP BY ORDER_NUM)
WHERE PROD > 1;






