-- LABORATORY WORK 1
-- BY Bondar_Liliia
/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
змінювати структуру таблиць та видаляти дані.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

CREATE USER student IDENTIFIED BY student;
DEFAULT TABLESPACE 'USERS' TEMPORARY TABLESPACE 'TEMP';
CREATE TABLE STUDENT_NAME;
GRANT 'CONNECT' TO student;
GRANT ALTER ANY TABLE TO student;









/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Турист забронював готель. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:


CREATE TABLE BOOKING (tourist_name VARCHAR2(30) NOT NULL);





  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:



GRANT INSERT ANY TABLE TO student;




/*---------------------------------------------------------------------------
3.a. 
Як звуть покупця, що не купив найдорожчий продукт.
Виконати завдання в Алгебрі Кодда. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:


SELECT
CUSTOMERS.CUST_NAME,
FROM CUSTOMERS,
 ORDERS,
 ORDERITEMS,
 PRODUCTS,
 (
 SELECT
 MAX(PRODUCTS.PROD_PRICE) AS PRICE











/*---------------------------------------------------------------------------
3.b. 
Вивести номер замовлення та назву товару у даному замовленні, що має найнижчу ціну у рамках замовлення.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:















/*---------------------------------------------------------------------------
c. 
Вивести країну та пошту покупця, як єдине поле client_name у нижньому регістрі, для тих покупців, що купляли продукти у постачальника з іменем "James". 
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

