/*1. Написати PL/SQL код, що по вказаному ключу покупцЯ додає в його замовленнЯ, 
що було зроблено першим, будь-Який продукт 10 разів, змінюючи order_item у циклі.
операціЯ виконуєтьсЯ, Якщо у даному замовлення вже є хочаб один товар. 10 балів*/
declare




/*2. Написати PL/SQL код, що по вказаному ключу продукту виводить у консоль його назму та визначає  його статус.
џкщо продукт не продаєтьсЯ  - статус  = "poor"
џкщо продукт продано до 2 рґзних замовлень включно - статус  = "common"
џкщо продукт продано бґльше нґж у 2 замовленнЯ - статус  = "rich" 4 бали*/

PRODUCTS.PROD_ID


/*3.  Cтворити предсавленнЯ та використати його у двох запитах:

3.1.  Вивести ґм'Я постачальника та номер замовленнЯ, куди не прода№ постачальник сво» продукти.

3.2.  Вивести ґм'Я постачальника та загальну кґлькґсть замовлень, куди постачальник продавам сво»
продукти 6 балґв.*/

create view
