/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
змінювати структуру таблиць.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
CREATE USER yavtukhovskiy IDENTIFIED BY yavtukhovskiy;
ALTER USER yavtukhovskiy GRANT "CONNECT";
GRANT ALTER ANY TABLE TO yavtukhovskiy;














/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Книжка складається з сторінок, на яких є рядки тексту.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

CREATE TABLE BOOKS(
  BOOK_NAME VARCHAR(30) NOT NULL
  )
  ALTER TABLE BOOKS
  ADD CONSTRAINT book_name_pk PRIMARY KEY BOOKS(book_name));
  
  
CREATE TABLE PAGE(
  PAGE_NUMBER NUMBER(38,0) NOT NULL,
  BOOK_OF VARCHAR(30) NOT NULL
  )
  ALTER TABLE PAGE
  ADD CONSTRAINT page_number_pk PRIMARY KEY(PAGE_NUMBER, BOOK_OF);
  ADD CONSTRAINT book_of_fk FOREIGN KEY(BOOK_OF) REFERENCES BOOKS(BOOK_NAME);
  

CREATE TABLE PAGE_ROW(
  ROW_LENGTH1 NUMBER(38, 0) NOT NULL,
  PAGE_OF NUMBER(38,0) NOT NULL,
  BOOK_OF VARCHAR(30) NOT NULL
  )
  ALTER TABLE PAGE_ROW
  ADD CONSTRAINT page_of_fk FOREIGN KEY(PAGE_OF) REFERENCES PAGE(PAGE_NUMBER);
  ADD CONSTRAINT book_of_fk FOREING KEY(BOOK_OF) REFERENCES BOOKS(BOOK_NAME);
  
















  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:
GRANT CREATE ANY TABLE TO yavtukhovskiy;
GRANT INSERT ANY TABLE TO yavtukhovskiy;







/*---------------------------------------------------------------------------
3.a. 
Як звуть покупця, що купив найдорожчий товар.
Виконати завдання в Алгебрі Кодда. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:














/*---------------------------------------------------------------------------
3.b. 
Яка країна, у якій живуть покупці має найкоротшу назву?
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:















/*---------------------------------------------------------------------------
c. 
Вивести країну та пошту покупця, як єдине поле client_name, для тих покупців, що мають замовлення, але воно порожнє (нема orderitems). 
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

