-- LABORATORY WORK 1
-- BY Antonov_Mykhailo

/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
модифікувати таблиці та вставляти дані
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:


CREATE USER antonov IDENTIFIED by antonov
DEFAULT TABLESPACE "SYSTEM"
TEMPORARY TABLESPACE "TEMP";

GRANT "CONNECT" TO antonov ;
GRANT "DATAPUMP_IMP_FULL_DATABASE" TO antonov ;
GRANT "IMP_FULL_DATABASE" TO antonov ;












/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Студент купляє квиток на потяг.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:


CREATE TABLE TABLE1 
(
  NAME_STUDENT VARCHAR2(20) NOT NULL,
  TICKET_NUMBER VARCHAR2(20) 
);


ALTER TABLE TABLE1 
ADD CONSTRAINT PRIMARY KEY TICKET_NUMBER;


  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:


GRANT ALTER ANY TABLE TO  antonov;
GRANT UPDATE ANY TABLE TO  antonov;




/*---------------------------------------------------------------------------
3.a. 
Якого товару найменше продано?
Виконати завдання в SQL. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:


SELECT CUST_NAME AS LOW_CUST FROM CUSTOMERS
WHERE QUANTITY=MIN(QUANTITY);












/*---------------------------------------------------------------------------
3.b. 
Скільки одиниць товару продано покупцям, що живуть в Америці?
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:



SELECT CUST_NAME,CUST_ZIP FROM CUSTOMERS
WHERE CUST_COUNTRY='USA';











/*---------------------------------------------------------------------------
c. 
Вивести імена постачальників, що не продали жодного зі своїх продуктів.
Виконати завдання в алгебрі Кодда. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

