/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
виконувати вибірку даних та створювати і змінювати таблиці. 4 бали

---------------------------------------------------------------------------*/
--Код відповідь:










/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Піца може складатися з різних наповнювачів. 4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

















  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:







/*---------------------------------------------------------------------------
3.a. Вивести дані про покупця, що проживає в Америці: його ім’я, назвавши стовпчик як client_name,
а його ZIP-код - назвавши цей стовпчик client_code напроти кожного покупця вивести номер його замовлення. 
Join використовувати заборонено. Виконати завдання в SQL. 4 бали
---------------------------------------------------------------------------*/

--Код відповідь:














/*---------------------------------------------------------------------------
3.b. Вивести дані покупця: його ім’я, назвавши client_name заголовок стовпчика та 
повну його адресу як одне поле, взявши zip код у дужки –  назва стовпчика client_address. 
Виконати завдання в SQL. 4 бали

---------------------------------------------------------------------------*/

--Код відповідь:















/*---------------------------------------------------------------------------
c. Вивести назву товару* на ім’я замовника, який його не замовляв. 
Виконати завдання в SQL. 4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

