-- LABORATORY WORK 1
-- BY Koltsov_Dmytro
/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
видаляти таблиці та робити запити з таблиць
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

CREATE USER KOLTSOV IDENTIFIED BY studentpma;
DEFAULT TABLESPACE "Dima";
TEMPORARY TABLESPACE "Temp";

ALTER USER KOLTSOV QUOTA 100M on USERS;

GRANT "CONECT" to KOLTSOV;

GRANT DROP ANY TABLE TO KOLTSOV;
GRANT SELECT ANY TABLE TO KOLTSOV;








/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
На комп'ютері встановлено OS Windows.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

















  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:







/*---------------------------------------------------------------------------
3.a. 
Як звуть покупців, що не купляли найдешевший товар.
Виконати завдання в Алгебрі Кодда. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:

SELECT cust_name
FROM CUSTOMERS CU, ORDERS O, ORDERITEMS OI
WHERE
    CU.CUST_ID = O.CUST_ID
    AND
    O.ORDER_NUM = OI.ORDER_NUM
    AND
    OI.ITEM_PRICE = 2.49 /*in select ITEM_PRICE 
                        from ORDERITEMS
                        where min(ORDERITEMS.ITEM_PRICE)*/












/*---------------------------------------------------------------------------
3.b. 
Вивести імена покупців, що не мають поштової адреси, але мають замовлення.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:

















/*---------------------------------------------------------------------------
c. 
Вивести імена постачальників у верхньому регістрі,назвавши це поле vendor_name, що продають товар з найдовшим коментарем.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

SELECT VENDORS_NAME as vendor_name
FROM VENDORS
WHERE
