-- LABORATORY WORK 1
-- BY Pasko_Volodymyr
/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
cтворювати та змінювати структуру таблиць.
4 бали

---------------------------------------------------------------------------*/
----Код відповідь:
CREATE USER student IDENTIFIED BY student
DEFAULT TABLESPACE 'users'
TEMPORARY TABLESPACE 'temp'
ALTER user student 
GRANT ACCESS SELECT, ALTER; 









/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Лікар лікує хворобу ліками.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
CREATE TABLE DOCTOR(
    doc_name varchar(30) NOT NULL
);

CREATE TABLE DISEASE(
    disease_name varchar(30) NOT NULL
);

CREATE TABLE MEDICINE(
    medicine_name varchar(30) NOT NULL
);

ALTER TABLE DOCTOR ADD PRIMARY KEY(doc_name);
ALTER TABLE MEDICINE ADD PRIMARY KEY(medicine_name);
ALTER TABLE DISEASE ADD PRIMARY KEY(disease_name);











  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:







/*---------------------------------------------------------------------------
3.a. 
Як звуть покупця, що купив продукт у постачальника, що проживає в Америці.
Виконати завдання в Алгебрі Кодда. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:















/*---------------------------------------------------------------------------
3.b. 
Яка називається товар, який має найменшу ціну у замовленнях?
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:
SELECT prod_name
FROM PRODUCTS, ORDERITEMS
WHERE ORDERITEMS.PROD_ID = PRODUCTS.PROD_ID
    AND ORDERITEMS.ITEM_PRICE IN (SELECT 
    MIN(ORDERITEMS.ITEM_PRICE)
    FROM ORDERITEMS);














/*---------------------------------------------------------------------------
c. 
Вивести країну та пошту покупця, як єдине поле client_name у верхньому регістрі, для тих покупців, що мають замовлення, що містить товар з назвою "Toy". 
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
SELECT UPPER(cust_country || ' ' || cust_email) as client_name 
FROM CUSTOMERS, ORDERS, ORDERITEMS, PRODUCTS
WHERE CUSTOMERS.CUST_ID = ORDERS.CUST_ID 
    AND ORDERS.ORDER_NUM = ORDERITEMS.ORDER_NUM 
    AND ORDERITEMS.PROD_ID = PRODUCTS.PROD_ID
    AND PRODUCTS.PROD_NAME = 'Toy';
    
    
    
    
    
