-- LABORATORY WORK 2
-- BY Pasko_Volodymyr
/*---------------------------------------------------------------------------
1. Вивести ключ покупця та ключ постачальника та кількість куплених покупцем продуктів у постачальника.

---------------------------------------------------------------------------*/
--Код відповідь:
--SELECT cust_id, vend_id







  
/* --------------------------------------------------------------------------- 
2.  Вивести ключ постачальника на номери замовлень, що містять по 2 куплених його товарів.

---------------------------------------------------------------------------*/
--Код відповідь:
SELECT vend_id, order_num
FROM ORDERITEMS JOIN PRODUCTS 
ON  














