-- LABORATORY WORK 1
-- BY Slobodianiuk_Illia

/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
змінювати структуру таблиць.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

CREATE USER ILLIA;

CREATE TABLE STUDENT SURNAME (
  SURNAME VARCHAR(30) NOT NULL,
);








/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Книжка складається з сторінок, на яких є рядки тексту.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:



CREATE TABLE book (
    book_id       NUMBER(6) NOT NULL,
    book_name     VARCHAR2(20) NOT NULL,
    book_author   VARCHAR2(20) NOT NULL, 
    book_year     NUMBER(6) NOT NULL,
    CONSTRAINT pk_book PRIMARY KEY ( book_id )
);

CREATE TABLE book_page (
    page_id       NUMBER(6) NOT NULL,
    book_id       NUMBER(6) NOT NUll,
    page_number   NUMBER(6) NOT NULL,
    CONSTRAINT pk_book_page PRIMARY KEY ( page_id )
);

    
CREATE TABLE cover_book (
    cover_id         NUMBER(6) NOT NULL,
    book_id          NUMBER(6) NOT NULL,
    cover_color      VARCHAR2(10) NOT NULL,
    cover_hardness   NUMBER(2) NOT NULL,
    CONSTRAINT pk_cover_book PRIMARY KEY ( cover_id )
);
    













  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:


  GRANT INSERT ANY TABLE TO 
  ILLIA




/*---------------------------------------------------------------------------
3.a. 
Як звуть покупця, що купив найдорожчий товар.
Виконати завдання в Алгебрі Кодда. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:














/*---------------------------------------------------------------------------
3.b. 
Яка країна, у якій живуть покупці має найкоротшу назву?
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:















/*---------------------------------------------------------------------------
c. 
Вивести країну та пошту покупця, як єдине поле client_name, для тих покупців, що мають замовлення, але воно порожнє (нема orderitems). 
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:



