-- LABORATORY WORK 1
-- BY Trishyna_Anna
/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
робити вибірки з таблиць та оновлювати дані
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:


CREATE USER TRISHYNA INDENTEFIED BY TRISHYNA
DEFAULT TABLESPACE 'USERS';
TEMPORARY TABLESPACE 'TEMP';
ALTER USER TO TRISHYNA QUOTA 100M ON USERS;
GRANT "CONNECT" TO TRISHYNA;
GRANT SELECT ANY TABLE TO TRISHYNA
GRANT ALTER ANY TABLE TO TRISHYNA







/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
На вулиці стоїть будинок, що має 10 квартир.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:


CREATE TABLE HOUSE,NUMBERFLAT
( HOUSE_NAME VARCHAR2(10);
NUMBERFLAT VARCHAR2(10)

WHERE 














  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:

GRANT ALTER ANY TABLE TO TRISHYNA





/*---------------------------------------------------------------------------
3.a. 
Який номер замовлення куди входить найдорожчий товар та яке ім'я покупця цього замовлення?
Виконати завдання в алгебрі Кодда.
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:


PROJECT * FROM PRODUCTS
WHERE PROD_PRICE>% UNION PROD_NAME(PROD_PRICE)













/*---------------------------------------------------------------------------
3.b. 
Визначити скільки унікальних електронних адрес покупців - назвавши це поле count_email.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:



SELECT * FROM CUSTUMERS
WHERE COUNT_EMAIL











/*---------------------------------------------------------------------------
c. 
Вивести імена постачальників у нижньому регістрі,назвавши це поле vendor_name, що мають товар, але його ніхто не купляв.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:


