-- LABORATORY WORK 1
-- BY Mitrokhin_Oleksii
/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
видаляти дані з таблиці
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
CREATE USER mitrokhin IDENTIFIED mitrokhin
DEFAULT TABLESPACE "USERS"
 TABLESPACE "TEST"









/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Університет має факультети, що складаються з кафедр.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

CREATE TABLE University(
name_university VARCHAR2(30) not null
);
ALTER TABLE University
ADD CONSTRAINT university_pk PRIMARY KEY (name_university);

CREATE TABLE Fakultet(
fakultet_name VARCHAR2(30) not  null
university_name VARCHAR2(30) not null
fakultet_id INT not null
);

ALTER TABLE Fakultet
ADD CONSTRAINT fakultet_pk PRIMARY KEY (fakultet_id);
ALTER TABLE Fakultet
ADD CONSTRAINT fakultet_fk FOREIGN KEY (university_name) REFERENCES University

CREATE TABLE Kafedra(
kafedra_name VARCHAR2(30) not null
fakultet_name VARCHAR2(30) not null
university_name VARCHAR2(30) not null
kafedra_id INT not null
);

ALTER TABLE Kafedra
ADD CONSTRAINT kafedra_pk PRIMARY KEY (kafedra_id);
ALTER TABLE Kafedra
ADD CONSTRAINT kafedra_fk FOREIGN KEY (university_name) REFERENCES University












  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:

-------------------------
-- Create Customers table
-------------------------







/*---------------------------------------------------------------------------
3.a. 
Який номер замовлення куди входить найдешевший товар?
Виконати завдання в SQL. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:














/*---------------------------------------------------------------------------
3.b. 
Визначити скільки різних країн зберігається в таблиці CUSTOMERS - назвавши це поле country.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:















/*---------------------------------------------------------------------------
c. 
Вивести імена постачальників у нижньому регістрі,назвавши це поле vendor_name, що мають товар і його хтось купив.
Виконати завдання в алгебрі Кодда. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

