-- LABORATORY WORK 1
-- BY Dziuba_Yevhen
/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
модифікувати таблиці та вставляти дані
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
CREATE USER dziuba IDENTIFIED BY dziuba;

GRANT "CONNECT" to dziuba;
CRAND CREATE ANY TO dziuba




















/*---------------------------------------------------------------------------

