/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
змінювати структуру таблиць
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
CREATE USER BABICH IDENTIFIED BY BABICH
DEFAULT TABLESPACE "USER";
TEMPLORARY TABLESPACE "TEMP";

GRANT ALTER ANY TABLE TO BABICH










/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Студент має залікову, що містить записи про дисципліни.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

CREATE TABLE STUDENTS (
student_name VARCHAR2(30) NOT NULL
);
ALTER TABLE STUDENTS ADD CONSTRAINT student_pk PRIMARY KEY (studen_name) 

CREATE TABLE DISTIPLINE (
distipline_name VARCHAR2(30) NOT NULL
);

ALTER TABLE DISTIPLINE ADD CONSTRAINT distipline_pk PRIMARY KEY (distipline_name)

ALTER TABLE STUDENTS ADD CONSTRAINT student_fk FOREIGN KEY distipline_pk REMAINING ON (student_pk) 
















  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:
GRANT SELECT ANY TABLE TO BABICH






/*---------------------------------------------------------------------------
3.a. 
Скільки проданого найдешевшого товару?
Виконати завдання в SQL. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:


SELECT  COUNT(client_products)
WHERE MIN(pice_products)
FROM Prodacts











/*---------------------------------------------------------------------------
3.b. 
Який PROD_ID товару, з найдовшою назвою?
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:


SELECT products
WHERE MAX(LEN(PROD_ID)












/*---------------------------------------------------------------------------
c. 
Вивести країну та пошту покупця, як єдине поле client_name, для тих покупців, що мають замовлення, але воно порожнє (нема orderitems).
Виконати завдання в алгебрі Кодда. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

