/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
змінювати структуру таблиць та створювати таблиці.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
Create user vasilisa_ushatska,
IDENTIFIED BY vasilisa
grant alter any table to vasilisa_ushatska
grant create any table to vasilisa_ushatska











/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Студент пише нотатки у блокноті.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь: 
create table notatock_1( notatock_body_1 char(250) )
alter table constraint  (notatock_1_name_pk char(30) not null)
primary key 

















  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:
alter grant select any table to vasilisa_ushatska







/*---------------------------------------------------------------------------
3.a. 
Як звуть покупця, що купив не найдорожчий товар.
Виконати завдання в Алгебрі Кодда. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:
project cust_name 















/*---------------------------------------------------------------------------
3.b. 
Яка країна, у якій живуть покупці має не найкоротшу назву?
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:
select length( CUST_COUNTRY  as max_county_name
from CUSTOMERS
where cust_country not like 'max_country_name'















/*---------------------------------------------------------------------------
c. 
Вивести країну та пошту покупця, як єдине поле client_name, для тих покупців, що не мають замовлення у яке входить найдорожчий товар. 
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
select cust_county , cust_email as client_name
from customers 
trim 

