/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
створювати таблиці
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

CREATE user kharchenko
IDENTIFIED users 

GRANT ANY CREATE by kharchenko;

/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Студент має мобільний номер іноземного оператора.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

CREATE TABLE student
  student_name varchar2(30)
  
ALTER TABLE student 
  student_name_pk Praymery KEY student_name  
  
CREATE TABLE phone
  cosntry varchar2(30)
  operators varchar2(30)
  phone nomber(10)

ALTER TABLE student 
  phone_pk Pramery KEY phone
  
CREATE TABLE know
  fk_student varchar2(30)
  fk_costry varchar2(30)
  fk_operators varchar2(30)
  fk_phone nomber(10)

ALTER TABLE know
  fk_student CONSTENT student from student
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:

GRANT ANY INSTAL by kharchenko;

/*---------------------------------------------------------------------------
3.a. 
Як звуть покупця, що купив найдешевший товар.
Виконати завдання в Алгебрі Кодда. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:

SELECT name 
From shop 
Where valume im select (
min(valyme) frome shop
)

/*---------------------------------------------------------------------------
3.b. 
Вивести імена покупців, що не мають поштової адреси та замовлення, у дужках - назвавши це поле client_name.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:

SELECT client_name(name)  
FROM shop
WHERE mail = not null


/*---------------------------------------------------------------------------
c. 
Вивести імена постачальників у верхньому регістрі,назвавши це поле vendor_name, що не мають жодного товару.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
SELECT client_name(name)  
FROM shop
WHERE 
