/*---------------------------------------------------------------------------
1. Вивести ключ постачальника, що не продав більше 2 продуктів різним покупцям.

---------------------------------------------------------------------------*/
--Код відповідь:


/*---------------------------------------------------------------------------
2.  Вивести ключ покупця, що має найдешевше замовлення.

---------------------------------------------------------------------------*/

--Код відповідь:

SELECT CUST_ID
FROM (
SELECT ORDER_NUM, ORDER_ITEM, CUST_ID
FROM Orders JOIN Orderltems
WHERE Orders.CUST_ID = Orderltems.CUST_ID;
)
WHERE ORDER_ITEM IN (SELECT  MIN(ORDER_ITEM) FROM Orderltems;);
