-- LABORATORY WORK 2
-- BY Pototska_Iryna
/*---------------------------------------------------------------------------
1. Вивести постачальників, що не продали жодного продукту та живуть в Америці.

---------------------------------------------------------------------------*/
--Код відповідь:


SELECT VEND_ID
FROM Vendors
WHERE VEND_COUNTRY='USA';

SELECT 








/*---------------------------------------------------------------------------
2.  Вивести номер найдешевшого замовлення та кількість товарів у ньому.

---------------------------------------------------------------------------*/

--Код відповідь:
SELECT OrderItems.QUANTITY 
FROM (SELECT Orders.ORDER_NUM 




