-- LABORATORY WORK 1
-- BY Khodos_Zlata
/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
робити вибірки з таблиць
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
CREATE USER khodos IDENTIFIED BY khodos
DEFAULT TABLESPACE users
TEMPORARY TABLESPACE temp
QUOTA 100M ON users;

GRANT SELECT ANY TABLE TO khodos;
/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Комп’ютер складається з апаратного (деталі: процесор, блок живлення) та програмного забезпечення.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:
GRANT CREATE ANY TABLE TO khodos;
GRANT ALTER ANY TABLE TO khodos;
GRANT SELECT ANY TABLE TO khodos;
/*---------------------------------------------------------------------------
3.a. 
Який номер замовлення куди входить найдорожчий товар?
Виконати завдання в SQL. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:
SELECT ORDERITEMS.ORDER_NUM
FROM ORDERITEMS, ORDERS
WHERE ORDERITEMS.ORDER_NUM IN ( SELECT MAX(QUANTITY*ITEM_PRICE),
                                ORDERITEMS.ORDER_NUM
        FROM ORDERITEMS
        )
AND ORDERITEMS.ORDER_NUM = ORDERS.ORDER_NUM;
/*---------------------------------------------------------------------------
3.b. 
Визначити скільки унікальних імен покупців - назвавши це поле count_name.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:
SELECT COUNT(CUST_NAME) AS COUNT_NAME
FROM CUSTOMERS 
WHERE CUST_NAME IN (SELECT DISTINCT CUST_NAME
FROM CUSTOMERS, ORDERS
WHERE CUSTOMERS.CUST_ID = ORDERS.CUST_ID
);
/*---------------------------------------------------------------------------
c. 
Вивести імена постачальників у нижньому регістрі,назвавши це поле vendor_name, що мають товар, але його ніхто не купляв.
Виконати завдання в алгебрі Кодда. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

/*від сутності постачальників відняти сутність в якій є постачальники в сутностях products, orderitems*/
/*VENDORS, ORDERITEMS, PRODUCTS, ORDERS*/
A = VENDORS RENAME VEND_ID,VEND_IDFK
B = ORDERS RENAME ORDER_NUM, ORDER_NUMBER
C = PRODUCTS RENAME PROD_ID, PROD_IDFK
D = A TIMES B TIMES C TIMES ORDERITEMS
E = VENDORS PROJECT VEND_IDFK
F = E WHERE 
