-- LABORATORY WORK 1
-- BY Khodos_Zlata
/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
робити вибірки з таблиць
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
CREATE USER khodos IDENTIFIED BY khodos
DEFAULT TABLESPACE users
TEMPORARY TABLESPACE temp
QUOTA 100M ON users;

GRANT SELECT ANY TABLE TO khodos;
/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Комп’ютер складається з апаратного (деталі: процесор, блок живлення) та програмного забезпечення.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:
GRANT CREATE ANY TABLE TO khodos;
GRANT ALTER ANY TABLE TO khodos;
GRANT SELECT ANY TABLE TO khodos;
/*---------------------------------------------------------------------------
3.a. 
Який номер замовлення куди входить найдорожчий товар?
Виконати завдання в SQL. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:
SELECT DISTINCT ORDERITEMS.ORDER_NUM
FROM ORDERITEMS 
WHERE QUANTITY*ITEM_PRICE IN 
  (SELECT MAX(QUANTITY*ITEM_PRICE) 
   FROM ORDERITEMS);
/*---------------------------------------------------------------------------
3.b. 
Визначити скільки унікальних імен покупців - назвавши це поле count_name.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:
SELECT COUNT(distinct CUST_NAME) AS COUNT_NAME 
FROM CUSTOMERS 
WHERE CUST_NAME IN (
  SELECT CUST_NAME 
  FROM CUSTOMERS, ORDERS 
  WHERE CUSTOMERS.CUST_ID = ORDERS.CUST_ID );
/*---------------------------------------------------------------------------
c. 
Вивести імена постачальників у нижньому регістрі,назвавши це поле vendor_name, що мають товар, але його ніхто не купляв.
Виконати завдання в алгебрі Кодда. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
A = VENDORS RENAME LOWER(VEND_NAME), VENDOR_NAME 
B = VENDORS PROJECT A 
C = VENDORS RENAME VEND_ID, VEND_IDFK 
D = PRODUCTS RENAME PROD_ID, PROD_IDFK 
E = C TIMES D TIMES ORDERITEMS 
F = E WHERE (VEND_ID = VEND_IDFK AND PROD_ID = PROD_IDFK) 
G = A PROJECT F 
H = B MINUS G
