/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
змінювати структуру таблиць.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:


-- USER SQL
CREATE USER chechel IDENTIFIED BY 1111 ;

-- QUOTAS

-- ROLES

-- SYSTEM PRIVILEGES
GRANT ALTER ANY TABLE TO chechel ;







/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Книжка складається з сторінок, на яких є рядки тексту.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
CREATE TABLE CHECHEL.BOOKS 
(
  BOOK_NAME VARCHAR2(255) NOT NULL,
  ID NUMBER NOT NULL 
);

CREATE TABLE CHECHEL.PAGES 
(
  ID NUMBER NOT NULL 
, PAGE_NUMBER NUMBER NOT NULL 
, STRING_TEXT VARCHAR2(20) NOT NULL 
, BOOK_ID NUMBER NOT NULL 
);



ALTER TABLE `chechel.books` ADD CONSTRAINT PK_BOOKS PRIMARY KEY (id);
ALTER TABLE `chechel.pages` ADD CONSTRAINT PK_PAGES PRIMARY KEY (id);
ALTER TABLE `chechel.pages`
ADD CONSTRAINT FK_PAGES_BOOK_ID FOREIGN KEY (book_id) REFERENCES `chechel.books` (id);


  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:
GRANT CREATE ANY TABLE TO "CHECHEL" ;






/*---------------------------------------------------------------------------
3.a. 
Як звуть покупця, що купив найдорожчий товар.
Виконати завдання в Алгебрі Кодда. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:














/*---------------------------------------------------------------------------
3.b. 
Яка країна, у якій живуть покупці має найкоротшу назву?
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:

SELECT MIN(`customers`.CUST_COUNTRY) FROM `customers`;













/*---------------------------------------------------------------------------
c. 
Вивести країну та пошту покупця, як єдине поле client_name, для тих покупців, що мають замовлення, але воно порожнє (нема orderitems). 
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
SELECT CONCAT(CUST_EMAIL, CUST_COUNTRY) FROM customers WHERE 
EXISTS 
(SELECT * FROM orders HAVING count(SELECT * from orderitems WHERE orderditems.order_num = orders.order_num) == 0);
