-- LABORATORY WORK 2
-- BY Morozov_Artem
/*---------------------------------------------------------------------------
1. Вивести ключ покупця та ключ продукту за умови, що постачальник купив більше 5 одиниць цього продукту.

---------------------------------------------------------------------------*/
--Код відповідь:
select cust_id, prod_id from orderitems inner join orders
where quantity > 5 









  
/* --------------------------------------------------------------------------- 
2.  Вивести ключ постачальника на номери замовлень, що містять більше одного з його товарів.

---------------------------------------------------------------------------*/
--Код відповідь:




