-- LABORATORY WORK 3
-- BY Haleta_Maksym

/*1. Написати PL/SQL код, що додає продукт постачальнику з ключем BRS01, щоб сумарна кількість його продуктів була 4. 
Ключі нових продуктів   - prod1…prodn. Решта обов’язкових полів береться з продукту з ключем BRO1.
10 балів*/

/*2. Написати PL/SQL код, що по вказаному ключу замовника виводить у консоль його ім'я та визначає  його статус.
Якщо він купив найдорожчий продукт - статус  = "yes"
Якщо він не купив найдорожчий продукт- статус  = "no"
Якщо він немає замовлення - статус  = "unknown*/


/*3. Створити представлення та використати його у двох запитах:
3.1. Вивести назву продукту та загальну кількість його продаж.
3.2. Яка сумарна кількість товарів була куплена покупцями, що проживають в Америці.
6 балів.*/
