-- LABORATORY WORK 1
-- BY Kulish_Oleh

/*---------------------------------------------------------------------------
1.Створити схему даних з назвою – прізвище студента, у якій користувач може: 
робити вибірки з таблиць
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
CREATE USER OLEH_KULISH(
  DEFAULT TABLESPACE "USERS",
  TEMP TABLESPACE "TEMP"
); 

ALTER USER OLEH_KULISH QUONT 100M ON USERS;

GRANT "CONECT" TO OLEH_KULISH;

GRANT ALTER ANY /*Якесь слово*/ TO OLEH_KULISH;






/*---------------------------------------------------------------------------
2. Створити таблиці, у яких визначити поля та типи. Головні та зовнішні ключі 
створювати окремо від таблиць використовуючи команди ALTER TABLE. 
Громадянин України має власне житло та автомобіль.
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:
CREATE TABLE PEOPLES (people VARCHAR(20));
ALTER TABLE PEOPLES 
    ADD CONSTRAINT people_pk PRIMARY KEY (people);

CREATE TABLE HOMES (home VARCHAR(25));
ALTER TABLE HOMES
    ADD CONSTRAINT home_pk PRIMARY KEY (home);

CREATE TABLE CARS (car VARCHAR(25));
ALTER TABLE CARS
    ADD CONSTRAINT car_pk PRIMARY KEY (car);














  
/* --------------------------------------------------------------------------- 
3. Надати додаткові права користувачеві (створеному у пункті № 1) для створення таблиць, 
внесення даних у таблиці та виконання вибірок використовуючи команду ALTER/GRANT. 
Згенерувати базу даних використовуючи код з теки OracleScript та виконати запити: 

---------------------------------------------------------------------------*/
--Код відповідь:
GRANT CREATE ANY /*Якесь слово*/ TO OLEH_KULISH;
GRANT ADD ANY /*Якесь слово*/ TO OLEH_KULISH;
GRANT ALTER ANY /*Якесь слово*/ TO OLEH_KULISH;




/*---------------------------------------------------------------------------
3.a. 
Як звуть постачальника, що продав найдешевший товар.
Виконати завдання в Алгебрі Кодда. 
4 бали
---------------------------------------------------------------------------*/

--Код відповідь:














/*---------------------------------------------------------------------------
3.b. 
Вивести імена покупців, що мають поштову адресу та живуть в USA, у верхньому регістрі - назвавши це поле client_name.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/

--Код відповідь:














/*---------------------------------------------------------------------------
c. 
Вивести імена постачальників у нижньому регістрі,назвавши це поле vendor_name, що мають товар, але його ніхто не купляв.
Виконати завдання в SQL. 
4 бали

---------------------------------------------------------------------------*/
--Код відповідь:

