/*1. Ќаписати PL/SQL код, що по вказаному ключу замовленнЯ дода№ в його будь-Який продукт 10 разґв, змґнюючи order_item у циклґ.
ЋперацґЯ викону№тьсЯ, Якщо у даному замовленнґ вже № хочаб один товар. 10 балґв*/


/*2. Ќаписати PL/SQL код, що по вказаному ключу замовленнЯ виводить у консоль його дату та изнача№  його статус.
џкщо воно ма№ 0 товарґв у серединґ - статус  = "poor"
џкщо воно ма№ до 2 товарґв включно - статус  = "common"
џкщо воно ма№ бґльше 2 товарґв - статус  = "rich" 4 бали*/

/*3. ‘творити предсавленнЯ та використати його у двох запитах:
3.1. ‚ивести ключ постачальника та номер замовленнЯ, та куди прода№ постачальник сво» продукти.*/
select vendors.vend_name, orderitems.order_num vend_zip
  from vendors, orderitems;




/*3.2. ‚ивести ґм'Я постачальника та загальну кґлькґсть проданих ним товарґв 6 балґв.*/
SELECT vendors.vend_num, orderitems.order_items  
  FROM vendors, orderitems; 
