/*---------------------------------------------------------------------------
1. Вивести ключ покупця та ключ продукту за умови, що постачальник купив більше 5 одиниць цього продукту.

---------------------------------------------------------------------------*/
--Код відповідь:
select customers.cust_id, PRODUCTS.PROD_ID 
  from customers, products , orderitems
    where (ORDERITEMS.QUANTITY > 5);







  
/* --------------------------------------------------------------------------- 
2.  Вивести ключ постачальника на номери замовлень, що містять більше одного з його товарів.

---------------------------------------------------------------------------*/
--Код відповідь:
select customers.cust_id, orderitems.order_num 
  from CUSTOMERS, ORDERITEMS
    where (ORDERITEMS.QUANTITY > 1);
