/*---------------------------------------------------------------------------
1. Вивести номери замовлення, кількість продуктів у замовленнях та кількість постачальників, що продавали продукт у замовлення.

---------------------------------------------------------------------------*/
--Код відповідь:










/*---------------------------------------------------------------------------
2.  Вивести ключ постачальника, продукти якого містяться кільки у найдешевших замовленнях.

---------------------------------------------------------------------------*/

--Код відповідь:
select VEND_ID FROM PRODUCTS where PROD_ID in (
select PROD_ID from ORDERITEMS where QUANTITY*ITEM_PRICE = 
  (select min(price) from (
  SELECT PROD_ID, ORDER_NUM, SUM(QUANTITY*ITEM_PRICE) as price
  from ORDERITEMS GROUP BY ORDER_NUM, PROD_ID)));
